### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.apim_platform.azapi_resource.app_backend_pool will be created
  + resource "azapi_resource" "app_backend_pool" {
      + body                      = {
          + properties = {
              + description = "Load Balancer of IO Services App Backend"
              + pool        = {
                  + services = [
                      + {
                          + id = (known after apply)
                        },
                    ]
                }
              + protocol    = null
              + type        = "Pool"
              + url         = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = (known after apply)
      + name                      = "io-services-app-backend-pool"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.ApiManagement/service/backends@2024-06-01-preview"
    }

  # module.apim_platform.azurerm_api_management_api.api_services_app_backend will be created
  + resource "azurerm_api_management_api" "api_services_app_backend" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + api_type              = (known after apply)
      + description           = "IO Services App Backend API"
      + display_name          = "IO Services App Backend"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-services-app-backend-api"
      + path                  = "api/catalog"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = false
      + version               = "v1"
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-services-cms/9b841ae4b757a15214636c7d3f3b122e47b0ec7c/apps/app-backend/api/external.yaml"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.apim_platform.azurerm_api_management_api_policy.app_backend will be created
  + resource "azurerm_api_management_api_policy" "app_backend" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-services-app-backend-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <set-backend-service backend-id="io-services-app-backend-pool" />
                    <set-header name="x-functions-key" exists-action="override">
                        <value>{{svc-appbe-host-key}}</value>
                    </set-header>
                    <rewrite-uri template="@(context.Request.Url.Path.Replace("/catalog", ""))" />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.apim_platform.azurerm_api_management_api_tag.services_app_backend_api_tag will be created
  + resource "azurerm_api_management_api_tag" "services_app_backend_api_tag" {
      + api_id = (known after apply)
      + id     = (known after apply)
      + name   = "IO-Services"
    }

  # module.apim_platform.azurerm_api_management_api_version_set.io_services_app_backend_v1 will be created
  + resource "azurerm_api_management_api_version_set" "io_services_app_backend_v1" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + display_name        = "IO Services App Backend v1"
      + id                  = (known after apply)
      + name                = "io_services_app_backend_v1"
      + resource_group_name = "io-p-itn-common-rg-01"
      + versioning_scheme   = "Segment"
    }

  # module.apim_platform.azurerm_api_management_backend.app_backends[0] will be created
  + resource "azurerm_api_management_backend" "app_backends" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + id                  = (known after apply)
      + name                = "io-p-itn-svc-app-be-func-01-1"
      + protocol            = "http"
      + resource_group_name = "io-p-itn-common-rg-01"
      + title               = "IO Services App Backend 1"
      + url                 = "https://io-p-itn-svc-app-be-func-01.azurewebsites.net"
    }

  # module.apim_platform.azurerm_api_management_named_value.app_backend_apim_key will be created
  + resource "azurerm_api_management_named_value" "app_backend_apim_key" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + display_name        = "svc-appbe-host-key"
      + id                  = (known after apply)
      + name                = "svc-appbe-host-key"
      + resource_group_name = "io-p-itn-common-rg-01"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.apim_platform.azurerm_api_management_product_api.app_backend will be created
  + resource "azurerm_api_management_product_api" "app_backend" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-services-app-backend-api"
      + id                  = (known after apply)
      + product_id          = "io-institutions"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.apim_platform.azurerm_api_management_tag.services_app_backend_tag will be created
  + resource "azurerm_api_management_tag" "services_app_backend_tag" {
      + api_management_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
      + display_name      = (known after apply)
      + id                = (known after apply)
      + name              = "IO-Services"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/cms_function_app.cms_storage_account/cmk.tf line 18, in resource "azurerm_key_vault_access_policy" "keys":
  18:   for_each     = (local.cmk_flags.kv && try(local.cmk_info.kv.same_subscription, false) && try(data.azurerm_key_vault.this["kv"].enable_rbac_authorization, false) == false ? toset(["kv"]) : toset([]))

The attribute "enable_rbac_authorization" is deprecated. Refer to the
provider documentation for details.

(and 3 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["sync-activations-from-legacy-poison"],
  on .terraform/modules/cms_function_app.cms_storage_account/storage_account.tf line 157, in resource "azurerm_storage_queue" "this":
 157:   storage_account_name = azurerm_storage_account.this.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 4 more similar warnings elsewhere)
```

</details>
